# Height Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IConnector..::..Height Property
IConnector Interface See Also
---
The height of the connector.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
double Height { get; }
```

Visual Basic
---
```text
ReadOnly Property Height As Double
	Get
```

Visual C++
---
```text
property double Height {
	double get ();
}
```

# Remarks
This property is used to retrieve the height of the connector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | Thrown when the connector's shape is not rectangular. |

# See Also
IConnector Interface
Autodesk.Revit.DB Namespace